Revit 2024 API
AnalysisDisplayStyleDeformedShapeTextLabelType Enumeration
 Defines text visualization types for deformed shape settings of analysis display style.
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2013
Since: 2013
Syntax
C#
public enum AnalysisDisplayStyleDeformedShapeTextLabelType
Visual Basic
Public Enumeration AnalysisDisplayStyleDeformedShapeTextLabelType
Visual C++
public enum class AnalysisDisplayStyleDeformedShapeTextLabelType
Members
Member name | Description
ShowAll |  Show vector text label for each point
ShowNone |  Don't show deformed shape text labels
ShowPredefined |  Show deformed shape text label only for points that have flag ValueAtPointFlags::DisplayText
See Also
Autodesk.Revit.DB.Analysis Namespace